zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/qspi_reg.h
#define QSPI_STATUS_SLVBEIF_Pos          (6)                                               /*!< QSPI_T::STATUS: SLVBEIF Position       */
#define QSPI_STATUS_SLVBEIF_Msk          (0x1ul << QSPI_STATUS_SLVBEIF_Pos)                /*!< QSPI_T::STATUS: SLVBEIF Mask           */

#define QSPI_STATUS_SLVURIF_Pos          (7)                                               /*!< QSPI_T::STATUS: SLVURIF Position       */
#define QSPI_STATUS_SLVURIF_Msk          (0x1ul << QSPI_STATUS_SLVURIF_Pos)                /*!< QSPI_T::STATUS: SLVURIF Mask           */

#define QSPI_STATUS_RXEMPTY_Pos          (8)                                               /*!< QSPI_T::STATUS: RXEMPTY Position       */
#define QSPI_STATUS_RXEMPTY_Msk          (0x1ul << QSPI_STATUS_RXEMPTY_Pos)                /*!< QSPI_T::STATUS: RXEMPTY Mask           */

#define QSPI_STATUS_RXFULL_Pos           (9)                                               /*!< QSPI_T::STATUS: RXFULL Position        */
#define QSPI_STATUS_RXFULL_Msk           (0x1ul << QSPI_STATUS_RXFULL_Pos)                 /*!< QSPI_T::STATUS: RXFULL Mask            */

#define QSPI_STATUS_RXTHIF_Pos           (10)                                              /*!< QSPI_T::STATUS: RXTHIF Position        */
#define QSPI_STATUS_RXTHIF_Msk           (0x1ul << QSPI_STATUS_RXTHIF_Pos)                 /*!< QSPI_T::STATUS: RXTHIF Mask            */

#define QSPI_STATUS_RXOVIF_Pos           (11)                                              /*!< QSPI_T::STATUS: RXOVIF Position        */
#define QSPI_STATUS_RXOVIF_Msk           (0x1ul << QSPI_STATUS_RXOVIF_Pos)                 /*!< QSPI_T::STATUS: RXOVIF Mask            */

#define QSPI_STATUS_RXTOIF_Pos           (12)                                              /*!< QSPI_T::STATUS: RXTOIF Position        */
#define QSPI_STATUS_RXTOIF_Msk           (0x1ul << QSPI_STATUS_RXTOIF_Pos)                 /*!< QSPI_T::STATUS: RXTOIF Mask            */

#define QSPI_STATUS_QSPIENSTS_Pos        (15)                                              /*!< QSPI_T::STATUS: SPIENSTS Position      */
#define QSPI_STATUS_QSPIENSTS_Msk        (0x1ul << QSPI_STATUS_QSPIENSTS_Pos)              /*!< QSPI_T::STATUS: SPIENSTS Mask          */

#define QSPI_STATUS_TXEMPTY_Pos          (16)                                              /*!< QSPI_T::STATUS: TXEMPTY Position       */
#define QSPI_STATUS_TXEMPTY_Msk          (0x1ul << QSPI_STATUS_TXEMPTY_Pos)                /*!< QSPI_T::STATUS: TXEMPTY Mask           */

#define QSPI_STATUS_TXFULL_Pos           (17)                                              /*!< QSPI_T::STATUS: TXFULL Position        */
#define QSPI_STATUS_TXFULL_Msk           (0x1ul << QSPI_STATUS_TXFULL_Pos)                 /*!< QSPI_T::STATUS: TXFULL Mask            */

#define QSPI_STATUS_TXTHIF_Pos           (18)                                              /*!< QSPI_T::STATUS: TXTHIF Position        */
#define QSPI_STATUS_TXTHIF_Msk           (0x1ul << QSPI_STATUS_TXTHIF_Pos)                 /*!< QSPI_T::STATUS: TXTHIF Mask            */

#define QSPI_STATUS_TXUFIF_Pos           (19)                                              /*!< QSPI_T::STATUS: TXUFIF Position        */
#define QSPI_STATUS_TXUFIF_Msk           (0x1ul << QSPI_STATUS_TXUFIF_Pos)                 /*!< QSPI_T::STATUS: TXUFIF Mask            */

#define QSPI_STATUS_TXRXRST_Pos          (23)                                              /*!< QSPI_T::STATUS: TXRXRST Position       */
#define QSPI_STATUS_TXRXRST_Msk          (0x1ul << QSPI_STATUS_TXRXRST_Pos)                /*!< QSPI_T::STATUS: TXRXRST Mask           */

#define QSPI_STATUS_RXCNT_Pos            (24)                                              /*!< QSPI_T::STATUS: RXCNT Position         */
#define QSPI_STATUS_RXCNT_Msk            (0xful << QSPI_STATUS_RXCNT_Pos)                  /*!< QSPI_T::STATUS: RXCNT Mask             */

#define QSPI_STATUS_TXCNT_Pos            (28)                                              /*!< QSPI_T::STATUS: TXCNT Position         */
#define QSPI_STATUS_TXCNT_Msk            (0xful << QSPI_STATUS_TXCNT_Pos)                  /*!< QSPI_T::STATUS: TXCNT Mask             */

#define QSPI_STATUS2_SLVBENUM_Pos        (24)                                              /*!< QSPI_T::STATUS2: SLVBENUM Position     */
#define QSPI_STATUS2_SLVBENUM_Msk        (0x3ful << QSPI_STATUS2_SLVBENUM_Pos)             /*!< QSPI_T::STATUS2: SLVBENUM Mask         */

#define QSPI_TX_TX_Pos                   (0)                                               /*!< QSPI_T::TX: TX Position                */
#define QSPI_TX_TX_Msk                   (0xfffffffful << QSPI_TX_TX_Pos)                  /*!< QSPI_T::TX: TX Mask                    */

#define QSPI_RX_RX_Pos                   (0)                                               /*!< QSPI_T::RX: RX Position                */
#define QSPI_RX_RX_Msk                   (0xfffffffful << QSPI_RX_RX_Pos)                  /*!< QSPI_T::RX: RX Mask                    */

/** @} QSPI_CONST */
/** @} end of QSPI register group */
/** @} end of REGISTER group */

#if defined ( __CC_ARM   )
    #pragma no_anon_unions
#endif

#endif /* __QSPI_REG_H__ */
